app/Models/AlunosModel.php

    public function getAlunos($id = false) {
        if ($id === false) {
            return $this->findAll();
        } else {
            return $this->asArray()
                ->where(['id' => $id])
                ->first();
---
SELECT *
FROM `alunos`
WHERE `alunos`.`deleted_at` IS NULL
SELECT *
FROM `alunos`
WHERE `id` = '3'
AND `alunos`.`deleted_at` IS NULL
 LIMIT 1